Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.PrintDrawings Method
Overload List
Name | Description
PrintDrawings(List<Drawing>, DPMPrinterAttributes)
 Prints the list of drawings using the given printer attributes.
PrintDrawings(IEnumerable<Drawing>, DPMPrinterAttributes, String)
 Prints the list of drawings using the given printer attributes.
Top
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace